# -*- coding: utf-8 -*-
"""
Created on Sat May 25 10:32:52 2024

@author: k5kei
"""

def make_1r():
    J = [1, 2, 3, 4]  # タスクID
    p = {1: 4, 2: 3, 3: 2, 4: 2}  # 各タスクの仕事量
    P = [(1, 2), (1, 3), (2, 4)]  # 各タスクの順序制約
    R = [1, 2, 3]  # 各ロボット種類のID
    T = 6  # 総期間長
    # 各期間ごとに仕事をスタートさせる費用，今回の問題では必要ない
    # c = {(j, t): 1 * (t - 1 + p[j]) for j in J for t in range(1, T - p[j] + 2)}
    # 各期間ごとにどの資源がどれだけ必要かが定義されるが，今回の問題では必要ない
    # a = {
    #     (1, 1, 0): 2,
    #     (2, 1, 0): 2,
    #     (2, 1, 1): 1,
    #     (2, 1, 2): 1,
    #     (3, 1, 0): 1,
    #     (3, 1, 1): 1,
    #     (4, 1, 0): 1,
    #     (4, 1, 1): 2,
    # }
    # 各期間ごとにどのロボットがどれだけ働けるか（各ロボットの台数）
    C = 0.1  # 故障確率の係数
    RUB = {
        (1, 1): 3,
        (1, 2): 3,
        (1, 3): 3,
        (1, 4): 3,
        (1, 5): 3,
        (1, 6): 3,
        (1, 7): 3,
        (2, 1): 1,
        (2, 2): 1,
        (2, 3): 1,
        (2, 4): 1,
        (2, 5): 1,
        (2, 6): 1,
        (2, 7): 1,
        (3, 1): 1,
        (3, 2): 1,
        (3, 3): 1,
        (3, 4): 1,
        (3, 5): 1,
        (3, 6): 1,
        (3, 7): 1,
    }

    return J, P, R, T, p, RUB, C
